using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace server
{
    internal class Result
    {
        private int _fu = 0;
        private int _han = 0;
        //private ulong _yakuMask = 0;
        public int Fu { get { return _fu; } }

        public Result(int _fu, ulong _yakumask)
        {





            _fu = ((_fu + 9) / 10) * 10;

        }

        private static int Ten(int _fu, int _han)
        {
            // 点数表作成
            var oyaTsumoTen = new Dictionary<Tuple<int, int>, int>();
            oyaTsumoTen.Add(new Tuple<int, int>(20, 2), 700);
            oyaTsumoTen.Add(new Tuple<int, int>(20, 3), 1300);
            oyaTsumoTen.Add(new Tuple<int, int>(20, 4), 2600);

            oyaTsumoTen.Add(new Tuple<int, int>(25, 3), 1600);
            oyaTsumoTen.Add(new Tuple<int, int>(25, 4), 3200);

            oyaTsumoTen.Add(new Tuple<int, int>(30, 1), 500);
            oyaTsumoTen.Add(new Tuple<int, int>(30, 2), 1000);
            oyaTsumoTen.Add(new Tuple<int, int>(30, 3), 2000);
            oyaTsumoTen.Add(new Tuple<int, int>(30, 4), 3900);

            oyaTsumoTen.Add(new Tuple<int, int>(40, 1), 700);
            oyaTsumoTen.Add(new Tuple<int, int>(40, 2), 1300);
            oyaTsumoTen.Add(new Tuple<int, int>(40, 3), 2600);
            oyaTsumoTen.Add(new Tuple<int, int>(40, 4), 4000);

            oyaTsumoTen.Add(new Tuple<int, int>(50, 1), 800);
            oyaTsumoTen.Add(new Tuple<int, int>(50, 2), 1600);
            oyaTsumoTen.Add(new Tuple<int, int>(50, 3), 3200);
            oyaTsumoTen.Add(new Tuple<int, int>(50, 4), 4000);

            oyaTsumoTen.Add(new Tuple<int, int>(60, 1), 1000);



            int ten = oyaTsumoTen[new Tuple<int, int>(_fu, _han)];

            return ten;
        }
    }
    //対応表：https://00m.in/gLZbi
    //親　()はツモった場合の子一人分
    //         1ハン    2ハン    3ハン    4ハン
    //20 符      -	      -        -        -
    //                  (700)   (1,300)  (2,600)

    //25 符	     -      2,400    4,800    9,600
    //                   (-)    (1,600)  (3,200)

    //30 符	   1,500    2,900    5,800   11,600
    //         (500)   (1,000)  (2,000)  (3,900)

    //40 符	   2,000    3,900    7,700   12,000
    //         (700)   (1,300)  (2,600)  (4,000)

    //50 符	   2,400    4,800    9,600   12,000    
    //         (800)   (1,600)  (3,200)  (4,000)

    //60 符	   2,900    5,800   11,600   12,000 
    //        (1,000)  (2,000)  (3,900)  (4,000)

    //70 符	   3,400    6,800   12,000   12,000 
    //        (1,200)  (2,300)  (4,000)  (4,000)

    //80 符    3,900    7,700   12,000   12,000 
    //        (1,300)  (2,600)  (4,000)  (4,000)

    //90 符    4,400    8,700   12,000   12,000 
    //        (1,500)  (2,900)  (4,000)  (4,000)

    //100 符   4,800    9,600   12,000   12,000 
    //        (1,600)  (3,200)  (4,000)  (4,000)

    //110 符   5,300   10,600   12,000   12,000 
    //          (-)    (3,600)  (4,000)  (4,000)

    // 5ハン    6,7ハン   8,9,10ハン  11,12ハン  13ハン以上
    //12,000    18,000     24,000      36,000      48,000
    //(4,000)   (6,000)    (8,000)    (12,000)    (16,000)


    //子　()はツモった場合
    //         1ハン    2ハン    3ハン    4ハン
    //20 符      -	      -        -        -
    //   子             (500)    (700)   (1,300)
    //   親             (700)   (1,300)  (2,600)

    //25 符	     -      1,600    3,200    6,400
    //   子              (-)     (800)   (1,600)
    //   親              (-)    (1,600)  (3,200)

    //30 符	   1,000    2,000    3,900    7,700
    //   子    (300)    (500)   (1,000)  (2,000)
    //   親    (500)   (1,000)  (2,000)  (3,900)

    //40 符	   1,300    2,600    5,200    8,000
    //   子    (400)    (700)   (1,300)  (2,000)
    //   親    (700)   (1,300)  (2,600)  (4,000)

    //50 符	   1,600    3,200    6,400    8,000
    //   子    (400)    (800)   (1,600)  (2,000)
    //   親    (800)   (1,600)  (3,200)  (4,000)

    //60 符	   2,000    3,900    7,700    8,000
    //   子    (500)   (1,000)  (2,000)  (2,000)
    //   親   (1,000)  (2,000)  (3,900)  (4,000)

    //70 符	   2,300    4,500    8,000    8,000
    //   子    (600)   (1,200)  (2,000)  (2,000)
    //   親   (1,200)  (2,300)  (4,000)  (4,000)

    //80 符    2,600    5,200    8,000    8,000
    //   子    (700)   (1,300)  (2,000)  (2,000)
    //   親   (1,300)  (2,600)  (4,000)  (4,000)

    //90 符    2,900    5,800    8,000    8,000
    //   子    (800)   (1,500)  (2,000)  (2,000) 
    //   親   (1,500)  (2,900)  (4,000)  (4,000)

    //100 符   3,200    6,400    8,000    8,000
    //   子    (800)   (1,600)  (2,000)  (2,000)
    //   親   (1,600)  (3,200)  (4,000)  (4,000)

    //110 符   3,600    7,100    8,000    8,000
    //   子     (-)    (1,800)  (2,000)  (2,000)
    //   親     (-)    (3,600)  (4,000)  (4,000)

    //    5ハン    6,7ハン   8,9,10ハン  11,12ハン  13ハン以上
    //    8,000    12,000     16,000      24,000      32,000
    //子 (2,000)   (3,000)    (4,000)     (6,000)     (8,000)
    //親 (4,000)   (6,000)    (8,000)    (12,000)    (16,000)
}
